Revit 2027 API
NurbSpline.Knots Property
Return/set the knots of the nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleArray Knots { get; set; }
Public Property Knots As DoubleArray
	Get
	Set
public:
property DoubleArray^ Knots {
	DoubleArray^ get ();
	void set (DoubleArray^ value);
}
member Knots : DoubleArray with get, set
Property Value
DoubleArray
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace